TexasInstruments/ind-comms-sdk/examples/industrial_comms/ethernetip_adapter_demo/device_profiles/discrete_io_device/mii/am263px-lp/r5fss0-0_freertos/example.syscfg
mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

mpu_armv75.$name        = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr     = 0x50D00000;
mpu_armv75.size         = 14;
mpu_armv75.attributes   = "Device";
mpu_armv75.allowExecute = false;

mpu_armv76.$name        = "CONFIG_MPU_REGION5";
mpu_armv76.baseAddr     = 0x72000000;
mpu_armv76.size         = 14;
mpu_armv76.allowExecute = false;
mpu_armv76.attributes   = "NonCached";

mpu_armv77.$name             = "CONFIG_MPU_REGION6";
mpu_armv77.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv77.baseAddr          = 0x70000000;
mpu_armv77.size              = 16;
mpu_armv77.attributes        = "Cached+Sharable";

timer1.$name         = "CONFIG_TIMER0";
timer1.startTimer    = true;
timer1.timerCallback = "OSAL_FREERTOS_callbackTimer";
timer1.RTI.$assign   = "RTI4";

default_linker1.$name = "memory_configurator_default_linker0";

general1.$name        = "CONFIG_GENERAL0";
general1.heap_size    = 131072;
general1.linker.$name = "TIARMCLANG0";

region1.$name                                = "MEMORY_REGION_CONFIGURATION0";
region1.memory_region.create(12);
region1.memory_region[0].type                = "TCMA";
region1.memory_region[0].$name               = "R5F_VECS";
region1.memory_region[0].size                = 0x40;
region1.memory_region[0].auto                = false;
region1.memory_region[1].type                = "TCMA";
region1.memory_region[1].$name               = "R5F_TCMA";
region1.memory_region[1].size                = 0x7FC0;
region1.memory_region[2].type                = "TCMB";
region1.memory_region[2].size                = 0x8000;
region1.memory_region[2].$name               = "R5F_TCMB";
region1.memory_region[3].$name               = "OCRAM";
region1.memory_region[3].auto                = false;
region1.memory_region[3].size                = 0xF0000;
region1.memory_region[3].manualStartAddress  = 0x70090000;
region1.memory_region[4].type                = "FLASH";
region1.memory_region[4].auto                = false;
region1.memory_region[4].manualStartAddress  = 0x60100000;
region1.memory_region[4].size                = 0x80000;
region1.memory_region[4].$name               = "FLASH";
region1.memory_region[5].$name               = "USER_SHM_MEM";
region1.memory_region[5].auto                = false;
region1.memory_region[5].manualStartAddress  = 0x701D0000;
region1.memory_region[5].size                = 0x4000;
region1.memory_region[5].isShared            = true;
region1.memory_region[5].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[6].$name               = "LOG_SHM_MEM";
region1.memory_region[6].auto                = false;
region1.memory_region[6].manualStartAddress  = 0x701D4000;
region1.memory_region[6].size                = 0x4000;
region1.memory_region[6].isShared            = true;
region1.memory_region[6].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[7].type                = "CUSTOM";
region1.memory_region[7].$name               = "RTOS_NORTOS_IPC_SHM_MEM";
region1.memory_region[7].auto                = false;
region1.memory_region[7].manualStartAddress  = 0x72000000;
region1.memory_region[7].size                = 0x3E80;
region1.memory_region[7].isShared            = true;
region1.memory_region[7].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[8].type                = "CUSTOM";
region1.memory_region[8].$name               = "MAILBOX_HSM";
region1.memory_region[8].auto                = false;
region1.memory_region[8].manualStartAddress  = 0x44000000;
region1.memory_region[8].size                = 0x3CE;
region1.memory_region[8].isShared            = true;
region1.memory_region[8].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[9].type                = "CUSTOM";
region1.memory_region[9].$name               = "MAILBOX_R5F";
region1.memory_region[9].auto                = false;
region1.memory_region[9].manualStartAddress  = 0x44000400;
region1.memory_region[9].size                = 0x3CE;
region1.memory_region[9].isShared            = true;
region1.memory_region[9].shared_cores        = ["r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[10].$name              = "ICSS_PKT_BUF_MEM";
region1.memory_region[10].auto               = false;
region1.memory_region[10].size               = 0x10000;
region1.memory_region[10].isShared           = true;
region1.memory_region[10].shared_cores       = ["hsm0-0","icss_m0_pru0","icss_m0_pru1","r5fss0-1","r5fss1-0","r5fss1-1"];
region1.memory_region[11].$name              = "BOOTLOADER_MEM";
region1.memory_region[11].auto               = false;
region1.memory_region[11].manualStartAddress = 0x70040000;
region1.memory_region[11].size               = 0x50000;

section1.load_memory                  = "R5F_VECS";
section1.group                        = false;
section1.$name                        = "Vector Table";
section1.output_section.create(1);
section1.output_section[0].$name      = ".vectors";
section1.output_section[0].palignment = true;

section2.$name                        = "Text Segments";
section2.load_memory                  = "R5F_TCMA";
section2.output_section.create(5);
section2.output_section[0].$name      = ".text.hwi";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text.cache";
section2.output_section[1].palignment = true;
section2.output_section[2].$name      = ".text.mpu";
section2.output_section[2].palignment = true;
section2.output_section[3].$name      = ".text.boot";
section2.output_section[3].palignment = true;
section2.output_section[4].$name      = ".text:abort";
section2.output_section[4].palignment = true;

section3.load_memory                  = "OCRAM";
section3.$name                        = "Code and Read-Only Data";
section3.output_section.create(2);
section3.output_section[0].$name      = ".text";
section3.output_section[0].palignment = true;
section3.output_section[1].$name      = ".rodata";
section3.output_section[1].palignment = true;

section4.load_memory                  = "OCRAM";
section4.$name                        = "Data Segment";
section4.output_section.create(1);
section4.output_section[0].$name      = ".data";
section4.output_section[0].palignment = true;

section5.load_memory                             = "OCRAM";
section5.$name                                   = "Memory Segments";
section5.output_section.create(2);
section5.output_section[0].$name                 = ".sysmem";
section5.output_section[0].palignment            = true;
section5.output_section[0].output_sections_start = "__HEAP_START";
section5.output_section[0].output_sections_end   = "__HEAP_END";
section5.output_section[1].$name                 = ".fbtlthreadstack";
section5.output_section[1].palignment            = true;

