TexasInstruments/ind-comms-sdk/examples/industrial_comms/ethernetip_adapter_demo/device_profiles/discrete_io_device/mii/am263px-lp/r5fss0-0_freertos/example.syscfg
section6.$name                                    = "Stack Segments";
section6.load_memory                              = "R5F_TCMA";
section6.output_section.create(5);
section6.output_section[0].$name                  = ".irqstack";
section6.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section6.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section6.output_section[0].input_section.create(1);
section6.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section6.output_section[1].$name                  = ".fiqstack";
section6.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section6.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section6.output_section[1].input_section.create(1);
section6.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section6.output_section[2].$name                  = ".svcstack";
section6.output_section[2].output_sections_start  = "__SVC_STACK_START";
section6.output_section[2].output_sections_end    = "__SVC_STACK_END";
section6.output_section[2].input_section.create(1);
section6.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section6.output_section[3].$name                  = ".abortstack";
section6.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section6.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section6.output_section[3].input_section.create(1);
section6.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section6.output_section[4].$name                  = ".undefinedstack";
section6.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section6.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section6.output_section[4].input_section.create(1);
section6.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section7.$name                        = "Initialization and Exception Handling";
section7.load_memory                  = "R5F_TCMA";
section7.output_section.create(3);
section7.output_section[0].$name      = ".ARM.exidx";
section7.output_section[0].palignment = true;
section7.output_section[1].$name      = ".init_array";
section7.output_section[1].palignment = true;
section7.output_section[2].$name      = ".fini_array";
section7.output_section[2].palignment = true;

section8.load_memory                 = "USER_SHM_MEM";
section8.type                        = "NOLOAD";
section8.$name                       = "User Shared Memory";
section8.group                       = false;
section8.output_section.create(1);
section8.output_section[0].$name     = ".bss.user_shared_mem";
section8.output_section[0].alignment = 0;

section9.load_memory                 = "LOG_SHM_MEM";
section9.$name                       = "Log Shared Memory";
section9.group                       = false;
section9.type                        = "NOLOAD";
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.log_shared_mem";
section9.output_section[0].alignment = 0;

section10.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section10.type                        = "NOLOAD";
section10.$name                       = "IPC Shared Memory";
section10.group                       = false;
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.ipc_vring_mem";
section10.output_section[0].alignment = 0;

section11.load_memory                 = "MAILBOX_HSM";
section11.type                        = "NOLOAD";
section11.$name                       = "SIPC HSM Queue Memory";
section11.group                       = false;
section11.output_section.create(1);
section11.output_section[0].$name     = ".bss.sipc_hsm_queue_mem";
section11.output_section[0].alignment = 0;

section12.load_memory                 = "MAILBOX_R5F";
section12.$name                       = "SIPC R5F Queue Memory";
section12.group                       = false;
section12.type                        = "NOLOAD";
section12.output_section.create(1);
section12.output_section[0].$name     = ".bss.sipc_r5f_queue_mem";
section12.output_section[0].alignment = 0;

section13.$name                        = "TCMA Stack Segments";
section13.load_memory                  = "R5F_TCMA";
section13.output_section.create(1);
section13.output_section[0].$name      = ".stack";
section13.output_section[0].palignment = true;

section14.$name                        = "TCMB Stack Segments";
section14.load_memory                  = "R5F_TCMB";
section14.output_section.create(1);
section14.output_section[0].$name      = ".threadstack";
section14.output_section[0].palignment = true;

section15.$name                        = "Packet Buffer Memory";
section15.type                         = "NOLOAD";
section15.load_memory                  = "ICSS_PKT_BUF_MEM";
section15.group                        = false;
section15.output_section.create(1);
section15.output_section[0].$name      = ".bss.icss_emac_pktbuf_mem";
section15.output_section[0].palignment = true;

section16.$name                                   = "BSS Memory";
section16.load_memory                             = "BOOTLOADER_MEM";
section16.output_section.create(1);
section16.output_section[0].$name                 = ".bss";
section16.output_section[0].output_sections_start = "__BSS_START";
section16.output_section[0].output_sections_end   = "__BSS_END";
section16.output_section[0].palignment            = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.peripheralDriver.OSPI.$suggestSolution                       = "OSPI0";
flash1.peripheralDriver.OSPI.CLK.$suggestSolution                   = "OSPI0_CLK";
flash1.peripheralDriver.OSPI.D6.$suggestSolution                    = "MCAN1_RX";
flash1.peripheralDriver.OSPI.D4.$suggestSolution                    = "MCAN0_RX";
flash1.peripheralDriver.OSPI.D0.$suggestSolution                    = "OSPI0_D0";
i2c1.I2C.SCL.$suggestSolution                                       = "I2C1_SCL";
i2c1.I2C.SDA.$suggestSolution                                       = "I2C1_SDA";
ethernetip1["PRU-ICSS_IEP"].$suggestSolution                        = "PRU-ICSS_IEP";
ethernetip1["PRU-ICSS_IEP"].PR0_IEP0_EDC_SYNC_OUT0.$suggestSolution = "PR0_PRU1_GPIO19";
ethernetip1["PRU-ICSS_IEP"].PR0_IEP0_EDC_SYNC_OUT1.$suggestSolution = "SDFM0_CLK1";
ethernetip1["PRU-ICSS"].$suggestSolution                            = "PRU-ICSS";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO0.$suggestSolution             = "PR0_PRU0_GPIO0";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO1.$suggestSolution             = "PR0_PRU0_GPIO1";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO2.$suggestSolution             = "PR0_PRU0_GPIO2";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO3.$suggestSolution             = "PR0_PRU0_GPIO3";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO4.$suggestSolution             = "PR0_PRU0_GPIO4";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO5.$suggestSolution             = "PR0_PRU0_GPIO5";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO6.$suggestSolution             = "PR0_PRU0_GPIO6";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO8.$suggestSolution             = "PR0_PRU0_GPIO8";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO9.$suggestSolution             = "PR0_PRU0_GPIO9";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO10.$suggestSolution            = "PR0_PRU0_GPIO10";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO11.$suggestSolution            = "PR0_PRU0_GPIO11";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO12.$suggestSolution            = "PR0_PRU0_GPIO12";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO13.$suggestSolution            = "PR0_PRU0_GPIO13";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO14.$suggestSolution            = "PR0_PRU0_GPIO14";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO15.$suggestSolution            = "PR0_PRU0_GPIO15";
ethernetip1["PRU-ICSS"].PR0_PRU0_GPIO16.$suggestSolution            = "PR0_PRU0_GPIO16";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO0.$suggestSolution             = "PR0_PRU1_GPIO0";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO1.$suggestSolution             = "PR0_PRU1_GPIO1";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO2.$suggestSolution             = "PR0_PRU1_GPIO2";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO3.$suggestSolution             = "PR0_PRU1_GPIO3";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO4.$suggestSolution             = "PR0_PRU1_GPIO4";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO5.$suggestSolution             = "PR0_PRU1_GPIO5";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO6.$suggestSolution             = "PR0_PRU1_GPIO6";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO8.$suggestSolution             = "PR0_PRU1_GPIO8";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO9.$suggestSolution             = "PR0_PRU1_GPIO9";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO11.$suggestSolution            = "PR0_PRU1_GPIO11";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO12.$suggestSolution            = "PR0_PRU1_GPIO12";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO13.$suggestSolution            = "PR0_PRU1_GPIO13";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO14.$suggestSolution            = "PR0_PRU1_GPIO14";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO15.$suggestSolution            = "PR0_PRU1_GPIO15";
ethernetip1["PRU-ICSS"].PR0_PRU1_GPIO16.$suggestSolution            = "PR0_PRU1_GPIO16";
ethernetip1["PRU-ICSS_MDIO"].$suggestSolution                       = "PRU-ICSS_MDIO";
ethernetip1["PRU-ICSS_MDIO"].PR0_MDIO_MDIO.$suggestSolution         = "PR0_MDIO_MDIO";
ethernetip1["PRU-ICSS_MDIO"].PR0_MDIO_MDC.$suggestSolution          = "PR0_MDIO_MDC";
debug_log.uartLog.UART.$suggestSolution                             = "UART0";
